frontend/controllers/LanguecenterController.php

    public function actionView($id, $slug = null)
    {
        $this->layout = '@frontend/views/layouts/layout-frontend.php';
        $langue = $this->findModel($id);
        if ($slug != $langue->slug) {
            return $this->redirect(['languecenter/view', 'id' => $id, 'slug' => $langue->slug]);
        }
        $langue->number ++;
        $langue->save();
---
UPDATE `languecenter` SET `number`=150 WHERE `ID`=5

    protected function findModel($id)
    {
        if (($model = FLanguecenter::findOne($id)) !== null) {
---
SELECT * FROM `languecenter` WHERE `ID`='5'