frontend/controllers/SiteController.php

SELECT * FROM `config_param` WHERE `name`='NUMBER_LANGUE_IN_HOME'
SELECT COUNT(*) FROM `languecenter` WHERE `is_show`=1 ORDER BY `ordinal_view`
SELECT * FROM `languecenter` WHERE `is_show`=1 ORDER BY `ordinal_view` LIMIT 6
---
    public function actionIndex()
    {

       $query = FLanguecenter::find()->where(['is_show' => 1])->orderBy('ordinal_view ASC');
       $limit_Lang_home = FConfigParam::find()->where(['name' => 'NUMBER_LANGUE_IN_HOME'])->one();
        $count = $query->count();
        $pagination = new Pagination([
            'defaultPageSize' => $limit_Lang_home->value,
            'totalCount' => $count]);
        $models = $query->offset($pagination->offset)
            ->limit($pagination->limit)
            ->all();