frontend/widgets/bannertop.php

SELECT * FROM `config_param` WHERE `name`='NUMBER_IMAGE_TOP'
SELECT * FROM `advertise` WHERE (`is_show`=1) AND (`position`='top') AND (`type`='image') AND (`show_in` IS NULL) LIMIT 2
SELECT * FROM `advertise` WHERE (`is_show`=1) AND (`position`='top') AND (`type`='image') AND (`show_in` IS NULL)
---
    public function run() {
        parent::run();
        $limit_ad = FConfigParam::find()->where(['name' => 'NUMBER_IMAGE_TOP'])->one();
        if($limit_ad){
            $limit = $limit_ad->value;
        }
        else{
            $limit = 3;
        }
        $query = FAdvertise::find()->where(['is_show' => 1,'position'=>'top','type'=>'image','show_in'=>$this->lan_center]);
        $advertise = $query->limit($limit)
            ->all();
        $banner = null;
        if(!$advertise){

            $query1 = FAdvertise::find()->where(['is_show' => 1,'position'=>'top','type'=>'image','show_in'=>null]);
            $banner = $query1->one();