frontend/widgets/banner.php

SELECT * FROM `config_param` WHERE `name`='NUMBER_AD_IN_BODY'
SELECT * FROM `advertise` WHERE (((`is_show`=1) AND (`position`='body') AND (`show_in`=5)) AND (`start_at` <= NOW())) AND (`end_at` >= NOW()) LIMIT 2
---
    public function run() {
        parent::run();
        $limit_ad = FConfigParam::find()->where(['name' => 'NUMBER_AD_IN_BODY'])->one();
        if($limit_ad){
            $limit = $limit_ad->value;
        }
        else{
            $limit = 3;
        }
        $query = FAdvertise::find()->where(['is_show' => 1,'position'=>'body','show_in'=>$this->lan_center])
                ->andwhere(['<=', 'start_at', new Expression('NOW()')])
                ->andwhere(['>=', 'end_at', new Expression('NOW()')]);
        $advertise = $query->limit($limit)
            ->all();