frontend/widgets/mostView.php

SELECT * FROM `config_param` WHERE `name`='NUMBER_LANGUE_IN_MOST'
SELECT * FROM `languecenter` WHERE `is_show`=1 ORDER BY `number` DESC LIMIT 5
---
    public function run() {
        parent::run();
        $limit_Lang_most = FConfigParam::find()->where(['name' => 'NUMBER_LANGUE_IN_MOST'])->one();
        if($limit_Lang_most){
            $limit = $limit_Lang_most->value;
        }
        else{
            $limit = 10;
        }
        $query = FLanguecenter::find()->where(['is_show' => 1])->orderBy('number DESC');
        $mostViewlangs = $query->limit($limit)
            ->all();